{"modelTopology":{"class_name":"Sequential","config":{"name":"complex","layers":[{"class_name":"Dense","config":{"units":3,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense413","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.26999985359682394,"noise_shape":null,"seed":null,"name":"dropout_Dropout271","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense414","trainable":true}},{"class_name":"Dropout","config":{"rate":0.26999985359682394,"noise_shape":null,"seed":null,"name":"dropout_Dropout272","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense415","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./complex.weights.bin"],"weights":[{"name":"dense_Dense413/kernel","shape":[512,3],"dtype":"float32"},{"name":"dense_Dense413/bias","shape":[3],"dtype":"float32"},{"name":"dense_Dense414/kernel","shape":[3,100],"dtype":"float32"},{"name":"dense_Dense414/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense415/kernel","shape":[100,1],"dtype":"float32"}]}]}