{"modelTopology":{"class_name":"Sequential","config":{"name":"hypo","layers":[{"class_name":"Dense","config":{"units":2,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense280","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.26843066997478293,"noise_shape":null,"seed":null,"name":"dropout_Dropout184","trainable":true}},{"class_name":"Dense","config":{"units":114,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense281","trainable":true}},{"class_name":"Dropout","config":{"rate":0.26843066997478293,"noise_shape":null,"seed":null,"name":"dropout_Dropout185","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense282","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./hypo.weights.bin"],"weights":[{"name":"dense_Dense280/kernel","shape":[512,2],"dtype":"float32"},{"name":"dense_Dense280/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense281/kernel","shape":[2,114],"dtype":"float32"},{"name":"dense_Dense281/bias","shape":[114],"dtype":"float32"},{"name":"dense_Dense282/kernel","shape":[114,1],"dtype":"float32"}]}]}