{"modelTopology":{"class_name":"Sequential","config":{"name":"hypo","layers":[{"class_name":"Dense","config":{"units":25,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense99","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense100","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense101","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense102","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./hypo.weights.bin"],"weights":[{"name":"dense_Dense99/kernel","shape":[512,25],"dtype":"float32"},{"name":"dense_Dense99/bias","shape":[25],"dtype":"float32"},{"name":"dense_Dense100/kernel","shape":[25,20],"dtype":"float32"},{"name":"dense_Dense100/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense101/kernel","shape":[20,5],"dtype":"float32"},{"name":"dense_Dense101/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense102/kernel","shape":[5,1],"dtype":"float32"}]}]}