{"modelTopology":{"class_name":"Sequential","config":{"name":"open","layers":[{"class_name":"Dense","config":{"units":1,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense119","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.2619907892041171,"noise_shape":null,"seed":null,"name":"dropout_Dropout77","trainable":true}},{"class_name":"Dense","config":{"units":175,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense120","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2619907892041171,"noise_shape":null,"seed":null,"name":"dropout_Dropout78","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense121","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./open.weights.bin"],"weights":[{"name":"dense_Dense119/kernel","shape":[512,1],"dtype":"float32"},{"name":"dense_Dense119/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense120/kernel","shape":[1,175],"dtype":"float32"},{"name":"dense_Dense120/bias","shape":[175],"dtype":"float32"},{"name":"dense_Dense121/kernel","shape":[175,1],"dtype":"float32"}]}]}