{"modelTopology":{"class_name":"Sequential","config":{"name":"opinions","layers":[{"class_name":"Dense","config":{"units":1,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense192","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.2892365458550792,"noise_shape":null,"seed":null,"name":"dropout_Dropout131","trainable":true}},{"class_name":"Dense","config":{"units":25,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense193","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2892365458550792,"noise_shape":null,"seed":null,"name":"dropout_Dropout132","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense194","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2892365458550792,"noise_shape":null,"seed":null,"name":"dropout_Dropout133","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"relu6","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense195","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2892365458550792,"noise_shape":null,"seed":null,"name":"dropout_Dropout134","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense196","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./opinions.weights.bin"],"weights":[{"name":"dense_Dense192/kernel","shape":[512,1],"dtype":"float32"},{"name":"dense_Dense192/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense193/kernel","shape":[1,25],"dtype":"float32"},{"name":"dense_Dense193/bias","shape":[25],"dtype":"float32"},{"name":"dense_Dense194/kernel","shape":[25,20],"dtype":"float32"},{"name":"dense_Dense194/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense195/kernel","shape":[20,5],"dtype":"float32"},{"name":"dense_Dense195/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense196/kernel","shape":[5,1],"dtype":"float32"}]}]}